# WaveRandomSeed Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
Wave..::..WaveRandomSeed Property
Wave Class See Also
---
The property labeled "Random Seed" from the "Wave" schema.
**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2018.1
# Syntax
C#
---
```text
public static string WaveRandomSeed { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property WaveRandomSeed As String
	Get
```

Visual C++
---
```text
public:
static property String^ WaveRandomSeed {
	String^ get ();
}
```

# Remarks
This property is of type "AssetPropertyInteger" within the range of "0, 65535".
# See Also
Wave Class
Autodesk.Revit.DB.Visual Namespace